[
    {
        "id": 1,
        "type": "car",
        "img": "src/components/CardItems/img/yaris.png",
        "name": "TOYOTA Yaris GR",
        "description": "The production car is powered by a Gazoo Racing-built, turbocharged and direct/port-injected 1.6-litre G16E-GTS three-cylinder engine that produces 192–200 kW (257–268 hp; 261–272 PS) and 360–370 N⋅m (266–273 lb⋅ft) of torque. The engine is mated to a 6-speed V16-series intelligent manual transmission ('iMT') and 'GR-Four' permanent four-wheel drive system. It has a claimed 0–100 km/h (0–62 mph) acceleration in 5.2–5.5 seconds and an electronically limited top speed of 230 km/h (143 mph)"
    },
    {
        "id": 2,
        "type": "car",
        "img": "src/components/CardItems/img/gt r35.png",
        "name": "NISSAN GT-R R35",
        "description": "The GT-R is powered by the VR38DETT engine, a 3,799 cc (3.8 L; 231.8 cu in) 60° degree DOHC V6 engine – which is shorter than other V6 engines and benefits weight distribution. The engine is based on the VQ engine, but thoroughly modified to improve performance and suit the car.[59] It featured the innovative hybrid wet/dry-sump pressurized lubrication system, controlled thermostatically to withstand high g-force and closed-deck construction increase stiffness"
    },
    {
        "id": 3,
        "type": "car",
        "img": "src/components/CardItems/img/civic si.png",
        "name": "HONDA Civic SI",
        "description": "Under the hood of the Civic Si is a turbocharged 1.5-liter four-cylinder that makes 200 horsepower and 192 pound-feet of torque. That power is sent to the front wheels through a standard limited-slip differential and a six-speed manual transmission. The manual gearbox also now has a rev-match feature for drivers who haven't perfected the heel-and-toe technique, and it's easy to turn on or off"
    },
    {
        "id": 4,
        "type": "car",
        "img": "src/components/CardItems/img/supra.jpg",
        "name": "TOYOTA Supra MK4",
        "description": "Known as the 2JZ-GTE, this formidable contender has been swapped into almost every make and model. This Toyota Supra engine is rated at 321 horsepower and 315 lb-ft of torque, but we sill dissect that a little later. This allowed the MK4 Supra top speed to be 177 mph, but it was limited to 155 mph outside of Japan. The efficiency of sequential turbochargers allows the Mark 4 Supra to run 0-60 mph in 4.7 seconds. At the drag strip, a Toyota Supra 1/4 mile of 13 seconds at 109 mph made it quicker than many V8 competitors"
    },
    {
        "id": 5,
        "type": "car",
        "img": "src/components/CardItems/img/Mazda rx7.jpg",
        "name": "MAZDA RX-7",
        "description": "The third-generation RX‑7, (sometimes referred to as FD, chassis code FD3S for Japan and JM1FD for the North America), featured an updated body design. The 13B-REW engine was the first-ever mass-produced sequential twin-turbocharger system to be exported from Japan,[17] boosting power to 255 PS (188 kW; 252 hp) in 1992 and finally to 280 PS (206 kW; 276 hp) by the time production ended in Japan in 2002."
    },
    {
        "id": 6,
        "type": "car",
        "img": "src/components/CardItems/img/nissan nismo 370Z.jpg",
        "name": "NISSAN 370z",
        "description": "The NISMO version was introduced for the 2009 model year. The engine produces 350 hp (355 PS; 261 kW) at 7,400 rpm and 276 lb⋅ft (374 N⋅m) of torque at 5,200 rpm with revised ECU settings and exhaust setup. Transmission choice is limited to a 6-speed manual with Nissan's new 'SynchroRev Match' function. Handling is improved via stiffened springs and stabilizer bars compared to the 370Z Coupe."
    },
    {
        "id": 7,
        "type": "bike",
        "img": "src/components/CardItems/img/yamahar1.jpg",
        "name": "YAMAHA R1",
        "description": "The Yamaha YZF-R1 needs no introduction. Considered one of the most influential supersports ever made, the iconic Japanese motorcycle has been around for 25 years now. Its most recent update was in 2020, when a complete overhaul brought a new engine, top-of-the-line electronics and hardware, and several other features derived from Yamaha’s successful MotoGP endeavors. The Yamaha YZF-R1 and the higher-spec R1M continue into the 2023 Yamaha Motorcycle lineup, essentially unchanged over last year’s models."
    },
    {
        "id": 8,
        "type": "bike",
        "img": "src/components/CardItems/img/hondacbr.jpg",
        "name": "HONDA CBR 1000",
        "description": "The world calls the Honda CBR1000RR a Superbike for a reason: Because nothing short of a jet fighter offers the kind of immediate performance, reactive handling, and raw power that a CBR1000RR will give you. Anyone can make a motorcycle seem exciting on a video game, but the CBR1000RR delivers where it really counts: in the real world, in the canyons, or on the track. It all starts, of course, with its spectacular inline-four flat-crank engine, delivering visceral, analog power like nothing else can."
    },
    {
        "id": 9,
        "type": "bike",
        "img": "src/components/CardItems/img/Ninja h2r.jpg",
        "name": "KAWASAKI Ninja H2R",
        "description": "The 2023 Kawasaki Ninja H2R is a beastly hypersport that allows you to take your riding experience to the next level as the “middle” sibling of the H2 family in the 2023 Kawasaki lineup. This machine is not for beginners, as it is packed with a 998 cc supercharged engine that delivers horsepower and 121 lb-ft of torque! With a lightweight chassis and aerodynamic bodywork, the Ninja H2R is built for speed and performance, whether on the track or cruising on the open road."
    }
]

